-- MySQL dump 10.13  Distrib 8.0.15, for Linux (x86_64)
--
-- Host: localhost    Database: top
-- ------------------------------------------------------
-- Server version	8.0.15
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Courses`
--

DROP TABLE IF EXISTS courses;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE courses (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(500) DEFAULT NULL,
  `duration` int(10) unsigned DEFAULT NULL COMMENT '   ',
  `type` enum('DESIGN','PROGRAMMING','MARKETING','MANAGEMENT','BUSINESS') NOT NULL COMMENT ' :  /  /  / ',
  `description` varchar(500) DEFAULT NULL,
  `teacher_id` int(10) unsigned DEFAULT NULL COMMENT '  ,   ',
  `students_count` int(10) unsigned DEFAULT NULL COMMENT '   ',
  `price` int(10) unsigned DEFAULT NULL COMMENT '   ',
  `price_per_hour` float DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `teacher_idx` (`teacher_id`),
  CONSTRAINT `teacher` FOREIGN KEY (`teacher_id`) REFERENCES teachers (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=47 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Courses`
--

# LOCK TABLES courses WRITE;
/*!40000 ALTER TABLE courses DISABLE KEYS */;
INSERT INTO courses VALUES (1,'Веб-разработчик c 0 до PRO',10,'PROGRAMMING','Представляем вашему вниманию шикарный курс Веб-разработчик c 0 до PRO',1,99,189600,18960),(2,'Мобильный разработчик с нуля',10,'PROGRAMMING','Представляем вашему вниманию шикарный курс Мобильный разработчик с нуля',2,99,138000,13800),(3,'Java-разработчик',5,'PROGRAMMING','Представляем вашему вниманию шикарный курс Java-разработчик',10,176,78000,15600),(4,'PHP-разработчик с 0 до PRO',3,'PROGRAMMING','Представляем вашему вниманию шикарный курс PHP-разработчик с 0 до PRO',4,275,40000,13333.3),(5,'Python-разработчик с нуля',4,'PROGRAMMING','Представляем вашему вниманию шикарный курс Python-разработчик с нуля',10,396,60000,15000),(6,'Frontend-разработчик',9,'PROGRAMMING','Представляем вашему вниманию шикарный курс Frontend-разработчик',20,1100,80000,8888.89),(7,'Мобильный разработчик PRO',12,'PROGRAMMING','Представляем вашему вниманию шикарный курс Мобильный разработчик PRO',7,99,10000,833.333),(8,'Программист 1С-Битрикс',18,'PROGRAMMING','Представляем вашему вниманию шикарный курс Программист 1С-Битрикс',8,176,2000,111.111),(9,'С#-разработчик с нуля',30,'PROGRAMMING','Представляем вашему вниманию шикарный курс С#-разработчик с нуля',9,275,4000,133.333),(10,'Data Scientist с 0 до PRO',9,'PROGRAMMING','Представляем вашему вниманию шикарный курс Data Scientist с 0 до PRO',10,396,100000,11111.1),(11,'Аналитик данных на Python',3,'PROGRAMMING','Представляем вашему вниманию шикарный курс Аналитик данных на Python',11,1100,8000,2666.67),(12,'Веб-дизайн с нуля до PRO',10,'DESIGN','Представляем вашему вниманию шикарный курс Веб-дизайн с нуля до PRO',12,99,40613,4061.3),(13,'Рекламная графика',10,'DESIGN','Представляем вашему вниманию шикарный курс Рекламная графика',13,99,17100,1710),(14,'UX-дизайн',5,'DESIGN','Представляем вашему вниманию шикарный курс UX-дизайн',14,176,42750,8550),(15,'Анимация интерфейсов',3,'DESIGN','Представляем вашему вниманию шикарный курс Анимация интерфейсов',10,275,85500,28500),(16,'Дизайн интерьеров с нуля',4,'DESIGN','Представляем вашему вниманию шикарный курс Дизайн интерьеров с нуля',16,396,128250,32062.5),(17,'Графический дизайнер с нуля до PRO',9,'DESIGN','Представляем вашему вниманию шикарный курс Графический дизайнер с нуля до PRO',20,1100,171000,19000),(18,'Дизайн мобильных приложений',12,'DESIGN','Представляем вашему вниманию шикарный курс Дизайн мобильных приложений',18,99,21375,1781.25),(19,'Промо-сайты от Red Collar',18,'DESIGN','Представляем вашему вниманию шикарный курс Промо-сайты от Red Collar',19,176,4275,237.5),(20,'Скетчинг для дизайнеров',30,'DESIGN','Представляем вашему вниманию шикарный курс Скетчинг для дизайнеров',20,275,8550,285),(21,'Photoshop c 0 до PRO',9,'DESIGN','Представляем вашему вниманию шикарный курс Photoshop c 0 до PRO',21,396,213750,23750),(22,'Sound-design',3,'DESIGN','Представляем вашему вниманию шикарный курс Sound-design',22,1100,17100,5700),(23,'Cinema4D',10,'DESIGN','Представляем вашему вниманию шикарный курс Cinema4D',23,99,40613,4061.3),(24,'Sketch',10,'DESIGN','Представляем вашему вниманию шикарный курс Sketch',24,99,17100,1710),(25,'Figma',5,'DESIGN','Представляем вашему вниманию шикарный курс Figma',25,176,42750,8550),(26,'Интернет-маркетолог от Ingate',3,'MARKETING','Представляем вашему вниманию шикарный курс Интернет-маркетолог от Ingate',26,275,48000,16000),(27,'SMM-маркетолог от А до Я',4,'MARKETING','Представляем вашему вниманию шикарный курс SMM-маркетолог от А до Я',27,396,72000,18000),(28,'Performance-маркетинг',9,'MARKETING','Представляем вашему вниманию шикарный курс Performance-маркетинг',28,1100,96000,10666.7),(29,'Интернет-маркетолог от А до Я',12,'MARKETING','Представляем вашему вниманию шикарный курс Интернет-маркетолог от А до Я',46,99,12000,1000),(30,'Продвижение в Instagram',18,'MARKETING','Представляем вашему вниманию шикарный курс Продвижение в Instagram',47,176,2400,133.333),(31,'Сквозная аналитика',30,'MARKETING','Представляем вашему вниманию шикарный курс Сквозная аналитика',48,275,4800,160),(32,'Таргетолог от А до Я',9,'MARKETING','Представляем вашему вниманию шикарный курс Таргетолог от А до Я',49,396,120000,13333.3),(33,'UX-аналитик',3,'MARKETING','Представляем вашему вниманию шикарный курс UX-аналитик',25,1100,9600,3200),(34,'Управление репутацией',3,'MARKETING','Представляем вашему вниманию шикарный курс Управление репутацией',25,99,12000,4000),(35,'Как делать контент для YouTube',3,'MARKETING','Представляем вашему вниманию шикарный курс Как делать контент для YouTube',35,176,2400,800),(36,'SEO-специалист',5,'MARKETING','Представляем вашему вниманию шикарный курс SEO-специалист',36,275,4800,960),(37,'Вирусный маркетинг',4,'MARKETING','Представляем вашему вниманию шикарный курс Вирусный маркетинг',37,396,120000,30000),(38,'CRM-маркетолог',5,'MARKETING','Представляем вашему вниманию шикарный курс CRM-маркетолог',38,1100,9600,1920),(39,'Как открыть веб-студию',10,'MANAGEMENT','Представляем вашему вниманию шикарный курс Как открыть веб-студию',39,99,10000,1000),(40,'Как открыть салон красоты',12,'MANAGEMENT','Представляем вашему вниманию шикарный курс Как открыть салон красоты',40,176,2000,166.667),(41,'Управление командами',12,'MANAGEMENT','Представляем вашему вниманию шикарный курс Управление командами',41,275,4000,333.333),(42,'Управление Digital-проектами',12,'MANAGEMENT','Представляем вашему вниманию шикарный курс Управление Digital-проектами',42,396,100000,8333.33),(43,'Excel',55,'MANAGEMENT','Представляем вашему вниманию шикарный курс Excel',43,1100,8000,145.455),(44,'Продюсер онлайн-курсов',5,'MANAGEMENT','Представляем вашему вниманию шикарный курс Продюсер онлайн-курсов',44,99,10000,2000),(45,'Управление продуктом',3,'MANAGEMENT','Представляем вашему вниманию шикарный курс Управление продуктом',45,176,2000,666.667),(46,'SQL',2,'DESIGN',NULL,2,NULL,8550,4275);
/*!40000 ALTER TABLE courses ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `PurchaseList`
--

DROP TABLE IF EXISTS purchaseList;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE purchaseList (
  `id` INT AUTO_INCREMENT PRIMARY KEY,
  `student_name` varchar(500) DEFAULT NULL,
  `course_name` varchar(500) DEFAULT NULL,
  `price` int(11) DEFAULT NULL,
  `subscription_date` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `PurchaseList`
--

# LOCK TABLES purchaseList WRITE;
/*!40000 ALTER TABLE purchaseList DISABLE KEYS */;
INSERT INTO purchaseList (`id`, `student_name`, `course_name`, `price`, `subscription_date`) VALUES
                                                                                                 (1, 'Амбражевич Порфирий','Веб-разработчик c 0 до PRO',189600,'2018-01-02 00:00:00'),
                                                                                                 (2, 'Жариков Афанасий','Веб-разработчик c 0 до PRO',189600,'2018-05-17 00:00:00'),
                                                                                                 (3, 'Бойков Максим','Веб-разработчик c 0 до PRO',189600,'2018-02-16 00:00:00'),
                                                                                                 (4, 'Гайденко Илья','Веб-разработчик c 0 до PRO',189600,'2018-08-15 00:00:00'),
                                                                                                 (5, 'Ядрихинский Егор','Веб-разработчик c 0 до PRO',189600,'2018-07-01 00:00:00'),
                                                                                                 (6, 'Янпольский Михей','Веб-разработчик c 0 до PRO',189600,'2018-04-02 00:00:00'),
                                                                                                 (7, 'Фуриков Эрнст','Мобильный разработчик с нуля',138000,'2018-01-01 00:00:00'),
                                                                                                 (8, 'Носов Макар','Мобильный разработчик с нуля',138000,'2018-01-03 00:00:00'),
                                                                                                 (9, 'Земцовский Всеволод','Мобильный разработчик с нуля',138000,'2018-05-18 00:00:00'),
                                                                                                 (10, 'Бурцов Никита','Мобильный разработчик с нуля',138000,'2018-02-17 00:00:00'),
                                                                                                 (11, 'Перехваткин Сергей','Мобильный разработчик с нуля',138000,'2018-08-16 00:00:00'),
                                                                                                 (12, 'Никольский Всеслав','Мобильный разработчик с нуля',138000,'2018-07-02 00:00:00'),
                                                                                                 (13, 'Чичерин Федосий','Мобильный разработчик с нуля',138000,'2018-04-03 00:00:00'),
                                                                                                 (14, 'Кооскора Вениамин','Java-разработчик',78000,'2018-01-04 00:00:00'),
                                                                                                 (15, 'Грузинский Парфен','Java-разработчик',78000,'2018-05-19 00:00:00'),
                                                                                                 (16, 'Квасников Емельян','Java-разработчик',78000,'2018-02-18 00:00:00'),
                                                                                                 (17, 'Барсуков Виктор','Java-разработчик',78000,'2018-08-17 00:00:00'),
                                                                                                 (18, 'Лилов Тимофей','Java-разработчик',78000,'2018-07-03 00:00:00'),
                                                                                                 (19, 'Решетилов Изяслав','Java-разработчик',78000,'2018-04-04 00:00:00'),
                                                                                                 (20, 'Беленков Денис','PHP-разработчик с 0 до PRO',40000,'2018-01-05 00:00:00'),
                                                                                                 (21, 'Калашников Терентий','PHP-разработчик с 0 до PRO',40000,'2018-05-20 00:00:00'),
                                                                                                 (22, 'Кандаков Адриан','PHP-разработчик с 0 до PRO',40000,'2018-02-19 00:00:00'),
                                                                                                 (23, 'Абакумов Казимир','PHP-разработчик с 0 до PRO',40000,'2018-08-18 00:00:00'),
                                                                                                 (24, 'Клоков Ярослав','PHP-разработчик с 0 до PRO',40000,'2018-07-04 00:00:00'),
                                                                                                 (25, 'Ягренев Прохор','PHP-разработчик с 0 до PRO',40000,'2018-04-05 00:00:00'),
                                                                                                 (26, 'Блаженов Артем','Python-разработчик с нуля',60000,'2018-01-06 00:00:00'),
                                                                                                 (27, 'Молодых Елисей','Python-разработчик с нуля',60000,'2018-05-21 00:00:00'),
                                                                                                 (28, 'Дьячков Севастьян','Python-разработчик с нуля',60000,'2018-02-20 00:00:00'),
                                                                                                 (29, 'Катаев Павел','Python-разработчик с нуля',60000,'2018-08-19 00:00:00'),
                                                                                                 (30, 'Тургенев Самсон','Python-разработчик с нуля',60000,'2018-07-05 00:00:00'),
                                                                                                 (31, 'Герций Афанасий','Python-разработчик с нуля',60000,'2018-04-06 00:00:00'),
                                                                                                 (32, 'Элиашев Владимир','Frontend-разработчик',80000,'2018-01-07 00:00:00'),
                                                                                                 (33, 'Кутепов Ефим','Frontend-разработчик',80000,'2018-05-22 00:00:00'),
                                                                                                 (34, 'Ягафаров Никон','Frontend-разработчик',80000,'2018-02-21 00:00:00'),
                                                                                                 (35, 'Валевач Измаил','Frontend-разработчик',80000,'2018-08-20 00:00:00'),
                                                                                                 (36, 'Разин Кондрат','Frontend-разработчик',80000,'2018-07-06 00:00:00'),
                                                                                                 (37, 'Ремизов Эрнест','Frontend-разработчик',80000,'2018-04-07 00:00:00'),
                                                                                                 (38, 'Корбылев Якуб','Мобильный разработчик PRO',10000,'2018-01-08 00:00:00'),
                                                                                                 (39, 'Погребняк Давид','Мобильный разработчик PRO',10000,'2018-05-23 00:00:00'),
                                                                                                 (40, 'Елизаров Агап','Мобильный разработчик PRO',10000,'2018-02-22 00:00:00'),
                                                                                                 (41, 'Кортнев Дмитрий','Мобильный разработчик PRO',10000,'2018-08-21 00:00:00'),
                                                                                                 (42, 'Шуста Трофим','Мобильный разработчик PRO',10000,'2018-07-07 00:00:00'),
                                                                                                 (43, 'Ютилов Ерофей','Мобильный разработчик PRO',10000,'2018-04-08 00:00:00'),
                                                                                                 (44, 'Пономарев Валерьян','Программист 1С-Битрикс',2000,'2018-01-09 00:00:00'),
                                                                                                 (45, 'Щеглов Ким','Программист 1С-Битрикс',2000,'2018-05-24 00:00:00'),
                                                                                                 (46, 'Яшнов Владимир','Программист 1С-Битрикс',2000,'2018-02-23 00:00:00'),
                                                                                                 (47, 'Богачёв Тихон','Программист 1С-Битрикс',2000,'2018-08-22 00:00:00'),
                                                                                                 (48, 'Лассман Платон','Программист 1С-Битрикс',2000,'2018-07-08 00:00:00'),
                                                                                                 (49, 'Ярмухаметов Фома','Программист 1С-Битрикс',2000,'2018-04-09 00:00:00'),
                                                                                                 (50, 'Шаломенцев Феоктист','С#-разработчик с нуля',4000,'2018-01-10 00:00:00'),
                                                                                                 (51, 'Толмачёв Аристарх','С#-разработчик с нуля',4000,'2018-05-25 00:00:00'),
                                                                                                 (52, 'Дутов Александр','С#-разработчик с нуля',4000,'2018-02-24 00:00:00'),
                                                                                                 (53, 'Денисов Леон','С#-разработчик с нуля',4000,'2018-08-23 00:00:00'),
                                                                                                 (54, 'Мокренко Степан','С#-разработчик с нуля',4000,'2018-07-09 00:00:00'),
                                                                                                 (55, 'Архипов Петр','С#-разработчик с нуля',4000,'2018-04-10 00:00:00');
/*!40000 ALTER TABLE purchaseList ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Students`
--

DROP TABLE IF EXISTS students;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE students (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT ' ',
  `age` int(10) unsigned DEFAULT NULL COMMENT ' ',
  `registration_date` datetime NOT NULL COMMENT ' ',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Students`
--

# LOCK TABLES students WRITE;
/*!40000 ALTER TABLE students DISABLE KEYS */;
INSERT INTO students VALUES (1,'Фуриков Эрнст',18,'2016-01-01 00:00:00'),(2,'Амбражевич Порфирий',19,'2016-01-08 00:00:00'),(3,'Носов Макар',20,'2016-01-15 00:00:00'),(4,'Кооскора Вениамин',21,'2016-01-22 00:00:00'),(5,'Беленков Денис',22,'2016-01-29 00:00:00'),(6,'Блаженов Артем',23,'2016-02-05 00:00:00'),(7,'Элиашев Владимир',24,'2016-02-12 00:00:00'),(8,'Корбылев Якуб',25,'2016-02-19 00:00:00'),(9,'Пономарев Валерьян',26,'2016-02-26 00:00:00'),(10,'Шаломенцев Феоктист',27,'2016-03-04 00:00:00'),(11,'Шамило Федосий',28,'2016-03-11 00:00:00'),(12,'Коржаков Юлий',29,'2016-03-18 00:00:00'),(13,'Якусик Вячеслав',30,'2016-03-25 00:00:00'),(14,'Кутяков Ефрем',31,'2016-04-01 00:00:00'),(15,'Бондарев Игорь',32,'2016-04-08 00:00:00'),(16,'Журавлев Севастьян',33,'2016-04-15 00:00:00'),(17,'Иньшов Геннадий',34,'2016-04-22 00:00:00'),(18,'Шабанов Клавдий',35,'2016-04-29 00:00:00'),(19,'Жириновский Наум',36,'2016-05-06 00:00:00'),(20,'Шалаганов Константин',37,'2016-05-13 00:00:00'),(21,'Пичугин Дмитрий',38,'2016-05-20 00:00:00'),(22,'Гилёв Самсон',39,'2016-05-27 00:00:00'),(23,'Алексахин Валерий',40,'2016-06-03 00:00:00'),(24,'Коршиков Матвей',41,'2016-06-10 00:00:00'),(25,'Лавлинский Сидор',42,'2016-06-17 00:00:00'),(26,'Шведов Юрий',43,'2016-06-24 00:00:00'),(27,'Шмелёв Гаврила',18,'2016-07-01 00:00:00'),(28,'Караулин Борис',19,'2016-07-08 00:00:00'),(29,'Веденеев Кондрат',20,'2016-07-15 00:00:00'),(30,'Авдеев Панкратий',21,'2016-07-22 00:00:00'),(31,'Свалов Арсений',22,'2016-07-29 00:00:00'),(32,'Кахманова Захар',23,'2016-08-05 00:00:00'),(33,'Фунтусов Ярослав',24,'2016-08-12 00:00:00'),(34,'Алехин Максимильян',25,'2016-08-19 00:00:00'),(35,'Племянников Всеслав',26,'2016-08-26 00:00:00'),(36,'Гудков Харитон',27,'2016-09-02 00:00:00'),(37,'Жариков Афанасий',28,'2016-09-09 00:00:00'),(38,'Земцовский Всеволод',29,'2016-09-16 00:00:00'),(39,'Грузинский Парфен',30,'2016-09-23 00:00:00'),(40,'Калашников Терентий',31,'2016-09-30 00:00:00'),(41,'Молодых Елисей',32,'2016-10-07 00:00:00'),(42,'Кутепов Ефим',33,'2016-10-14 00:00:00'),(43,'Погребняк Давид',34,'2016-10-21 00:00:00'),(44,'Щеглов Ким',35,'2016-10-28 00:00:00'),(45,'Толмачёв Аристарх',36,'2016-11-04 00:00:00'),(46,'Саввин Онисим',37,'2016-11-11 00:00:00'),(47,'Бойков Максим',38,'2016-11-18 00:00:00'),(48,'Бурцов Никита',39,'2016-11-25 00:00:00'),(49,'Квасников Емельян',40,'2016-12-02 00:00:00'),(50,'Кандаков Адриан',41,'2016-12-09 00:00:00'),(51,'Дьячков Севастьян',18,'2016-12-16 00:00:00'),(52,'Ягафаров Никон',19,'2016-12-23 00:00:00'),(53,'Елизаров Агап',20,'2016-12-30 00:00:00'),(54,'Яшнов Владимир',21,'2017-01-06 00:00:00'),(55,'Дутов Александр',22,'2017-01-13 00:00:00'),(56,'Порошин Степан',23,'2017-01-20 00:00:00'),(57,'Загряжский Марк',24,'2017-01-27 00:00:00'),(58,'Цвиленев Никита',25,'2017-02-03 00:00:00'),(59,'Хватов Борислав',26,'2017-02-10 00:00:00'),(60,'Нюхалов Валентин',27,'2017-02-17 00:00:00'),(61,'Боварин Анатолий',28,'2017-02-24 00:00:00'),(62,'Закрятин Георгий',29,'2017-03-03 00:00:00'),(63,'Косков Иннокентий',30,'2017-03-10 00:00:00'),(64,'Лероев Парфен',31,'2017-03-17 00:00:00'),(65,'Тянников Иларион',32,'2017-03-24 00:00:00'),(66,'Сафонов Самуил',33,'2017-03-31 00:00:00'),(67,'Бугаков Валерий',34,'2017-04-07 00:00:00'),(68,'Гайденко Илья',35,'2017-04-14 00:00:00'),(69,'Перехваткин Сергей',36,'2017-04-21 00:00:00'),(70,'Барсуков Виктор',37,'2017-04-28 00:00:00'),(71,'Абакумов Казимир',38,'2017-05-05 00:00:00'),(72,'Катаев Павел',39,'2017-05-12 00:00:00'),(73,'Валевач Измаил',40,'2017-05-19 00:00:00'),(74,'Кортнев Дмитрий',41,'2017-05-26 00:00:00'),(75,'Богачёв Тихон',42,'2017-06-02 00:00:00'),(76,'Дейнекин Даниил',43,'2017-06-09 00:00:00'),(77,'Большаков Панкратий',18,'2017-06-16 00:00:00'),(78,'Царёв Герасим',19,'2017-06-23 00:00:00'),(79,'Бурда Рубен',20,'2017-06-30 00:00:00'),(80,'Можаев Адриан',21,'2017-07-07 00:00:00'),(81,'Давыдов Филипп',22,'2017-07-14 00:00:00'),(82,'Ядрихинский Егор',23,'2017-07-21 00:00:00'),(83,'Никольский Всеслав',24,'2017-07-28 00:00:00'),(84,'Лилов Тимофей',25,'2017-08-04 00:00:00'),(85,'Клоков Ярослав',26,'2017-08-11 00:00:00'),(86,'Тургенев Самсон',27,'2017-08-18 00:00:00'),(87,'Разин Кондрат',28,'2017-08-25 00:00:00'),(88,'Шуста Трофим',29,'2017-09-01 00:00:00'),(89,'Лассман Платон',30,'2017-09-08 00:00:00'),(90,'Вязьмитин Игнат',31,'2017-09-15 00:00:00'),(91,'Круминьш Виталий',32,'2017-09-22 00:00:00'),(92,'Янпольский Михей',33,'2017-09-29 00:00:00'),(93,'Чичерин Федосий',34,'2017-10-06 00:00:00'),(94,'Решетилов Изяслав',35,'2017-10-13 00:00:00'),(95,'Ягренев Прохор',36,'2017-10-20 00:00:00'),(96,'Герций Афанасий',37,'2017-10-27 00:00:00'),(97,'Ремизов Эрнест',38,'2017-11-03 00:00:00'),(98,'Ютилов Ерофей',39,'2017-11-10 00:00:00'),(99,'Ярмухаметов Фома',40,'2017-11-17 00:00:00'),(100,'Берлунов Вадим',41,'2017-11-24 00:00:00');
/*!40000 ALTER TABLE students ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Subscriptions`
--

DROP TABLE IF EXISTS subscriptions;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE subscriptions (
  `id` INT AUTO_INCREMENT PRIMARY KEY,
  `student_id` int(10) unsigned NOT NULL,
  `course_id` int(10) unsigned NOT NULL,
  `subscription_date` datetime NOT NULL,
  UNIQUE KEY `unq` (`student_id`,`course_id`),
  KEY `course_idx` (`course_id`),
  CONSTRAINT `course` FOREIGN KEY (`course_id`) REFERENCES courses (`id`),
  CONSTRAINT `student` FOREIGN KEY (`student_id`) REFERENCES students (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Subscriptions`
--

# LOCK TABLES subscriptions WRITE;
/*!40000 ALTER TABLE subscriptions DISABLE KEYS */;
INSERT INTO subscriptions (`id`, `student_id`, `course_id`, `subscription_date`) VALUES
                                                                                     (1, 2, 1, '2018-01-01 00:00:00'),
                                                                                     (2, 10, 1, '2018-04-11 00:00:00'),
                                                                                     (3, 1, 2, '2018-01-02 00:00:00'),
                                                                                     (4, 11, 2, '2018-04-12 00:00:00'),
                                                                                     (5, 2, 3, '2018-01-03 00:00:00'),
                                                                                     (6, 12, 3, '2018-04-13 00:00:00'),
                                                                                     (7, 3, 4, '2018-01-04 00:00:00'),
                                                                                     (8, 13, 4, '2018-04-14 00:00:00'),
                                                                                     (9, 4, 5, '2018-01-05 00:00:00'),
                                                                                     (10, 14, 5, '2018-04-15 00:00:00'),
                                                                                     (11, 5, 6, '2018-01-06 00:00:00'),
                                                                                     (12, 15, 6, '2018-04-16 00:00:00'),
                                                                                     (13, 6, 7, '2018-01-07 00:00:00'),
                                                                                     (14, 16, 7, '2018-04-17 00:00:00'),
                                                                                     (15, 7, 8, '2018-01-08 00:00:00'),
                                                                                     (16, 17, 8, '2018-04-18 00:00:00'),
                                                                                     (17, 8, 9, '2018-01-09 00:00:00'),
                                                                                     (18, 18, 9, '2018-04-19 00:00:00'),
                                                                                     (19, 9, 10, '2018-01-10 00:00:00'),
                                                                                     (20, 19, 10, '2018-04-20 00:00:00'),
                                                                                     (21, 10, 11, '2018-01-11 00:00:00'),
                                                                                     (22, 20, 11, '2018-04-21 00:00:00'),
                                                                                     (23, 11, 12, '2018-01-12 00:00:00'),
                                                                                     (24, 21, 12, '2018-04-22 00:00:00'),
                                                                                     (25, 12, 13, '2018-01-13 00:00:00'),
                                                                                     (26, 22, 13, '2018-04-23 00:00:00'),
                                                                                     (27, 13, 14, '2018-01-14 00:00:00'),
                                                                                     (28, 23, 14, '2018-04-24 00:00:00'),
                                                                                     (29, 14, 15, '2018-01-15 00:00:00'),
                                                                                     (30, 24, 15, '2018-04-25 00:00:00'),
                                                                                     (31, 15, 16, '2018-01-16 00:00:00'),
                                                                                     (32, 25, 16, '2018-04-26 00:00:00'),
                                                                                     (33, 16, 17, '2018-01-17 00:00:00'),
                                                                                     (34, 26, 17, '2018-04-27 00:00:00'),
                                                                                     (35, 17, 18, '2018-01-18 00:00:00'),
                                                                                     (36, 27, 18, '2018-04-28 00:00:00'),
                                                                                     (37, 18, 19, '2018-01-19 00:00:00'),
                                                                                     (38, 28, 19, '2018-04-29 00:00:00'),
                                                                                     (39, 19, 20, '2018-01-20 00:00:00'),
                                                                                     (40, 29, 20, '2018-04-30 00:00:00'),
                                                                                     (41, 20, 21, '2018-01-21 00:00:00'),
                                                                                     (42, 30, 21, '2018-05-01 00:00:00'),
                                                                                     (43, 21, 22, '2018-01-22 00:00:00'),
                                                                                     (44, 31, 22, '2018-05-02 00:00:00'),
                                                                                     (45, 22, 23, '2018-01-23 00:00:00'),
                                                                                     (46, 32, 23, '2018-05-03 00:00:00'),
                                                                                     (47, 23, 24, '2018-01-24 00:00:00'),
                                                                                     (48, 33, 24, '2018-05-04 00:00:00'),
                                                                                     (49, 24, 25, '2018-01-25 00:00:00'),
                                                                                     (50, 34, 25, '2018-05-05 00:00:00'),
                                                                                     (51, 25, 26, '2018-01-26 00:00:00'),
                                                                                     (52, 35, 26, '2018-05-06 00:00:00'),
                                                                                     (53, 26, 27, '2018-01-27 00:00:00'),
                                                                                     (54, 36, 27, '2018-05-07 00:00:00'),
                                                                                     (55, 27, 28, '2018-01-28 00:00:00'),
                                                                                     (56, 37, 28, '2018-05-08 00:00:00'),
                                                                                     (57, 28, 29, '2018-01-29 00:00:00'),
                                                                                     (58, 38, 29, '2018-05-09 00:00:00'),
                                                                                     (59, 29, 30, '2018-01-30 00:00:00'),
                                                                                     (60, 39, 30, '2018-05-10 00:00:00'),
                                                                                     (61, 30, 31, '2018-01-31 00:00:00'),
                                                                                     (62, 40, 31, '2018-05-11 00:00:00'),
                                                                                     (63, 31, 32, '2018-02-01 00:00:00'),
                                                                                     (64, 41, 32, '2018-05-12 00:00:00'),
                                                                                     (65, 32, 33, '2018-02-02 00:00:00'),
                                                                                     (66, 42, 33, '2018-05-13 00:00:00'),
                                                                                     (67, 33, 34, '2018-02-03 00:00:00'),
                                                                                     (68, 43, 34, '2018-05-14 00:00:00'),
                                                                                     (69, 34, 35, '2018-02-04 00:00:00'),
                                                                                     (70, 44, 35, '2018-05-15 00:00:00'),
                                                                                     (71, 35, 36, '2018-02-05 00:00:00'),
                                                                                     (72, 45, 36, '2018-05-16 00:00:00'),
                                                                                     (73, 1, 37, '2018-05-17 00:00:00'),
                                                                                     (74, 36, 37, '2018-02-06 00:00:00'),
                                                                                     (75, 2, 38, '2018-05-18 00:00:00'),
                                                                                     (76, 37, 38, '2018-02-07 00:00:00'),
                                                                                     (77, 3, 39, '2018-05-19 00:00:00'),
                                                                                     (78, 38, 39, '2018-02-08 00:00:00'),
                                                                                     (79, 4, 40, '2018-05-20 00:00:00'),
                                                                                     (80, 39, 40, '2018-02-09 00:00:00'),
                                                                                     (81, 5, 41, '2018-05-21 00:00:00'),
                                                                                     (82, 40, 41, '2018-02-10 00:00:00'),
                                                                                     (83, 6, 42, '2018-05-22 00:00:00'),
                                                                                     (84, 41, 42, '2018-02-11 00:00:00'),
                                                                                     (85, 7, 43, '2018-05-23 00:00:00'),
                                                                                     (86, 42, 43, '2018-02-12 00:00:00'),
                                                                                     (87, 8, 44, '2018-05-24 00:00:00'),
                                                                                     (88, 43, 44, '2018-02-13 00:00:00'),
                                                                                     (89, 9, 45, '2018-05-25 00:00:00'),
                                                                                     (90, 44, 45, '2018-02-14 00:00:00'),
                                                                                     (91, 10, 46, '2018-05-26 00:00:00'),
                                                                                     (92, 45, 46, '2018-02-15 00:00:00'),
                                                                                     (93, 11, 47, '2018-05-27 00:00:00'),
                                                                                     (94, 46, 47, '2018-02-16 00:00:00'),
                                                                                     (95, 12, 48, '2018-05-28 00:00:00'),
                                                                                     (96, 47, 48, '2018-02-17 00:00:00'),
                                                                                     (97, 13, 49, '2018-05-29 00:00:00'),
                                                                                     (98, 48, 49, '2018-02-18 00:00:00'),
                                                                                     (99, 14, 50, '2018-05-30 00:00:00'),
                                                                                     (100, 49, 50, '2018-02-19 00:00:00'),
                                                                                     (101, 15, 51, '2018-05-31 00:00:00'),
                                                                                     (102, 50, 51, '2018-02-20 00:00:00'),
                                                                                     (103, 16, 52, '2018-06-01 00:00:00'),
                                                                                     (104, 51, 52, '2018-02-21 00:00:00'),
                                                                                     (105, 17, 53, '2018-06-02 00:00:00'),
                                                                                     (106, 52, 53, '2018-02-22 00:00:00'),
                                                                                     (107, 18, 54, '2018-06-03 00:00:00'),
                                                                                     (108, 53, 54, '2018-02-23 00:00:00'),
                                                                                     (109, 19, 55, '2018-06-04 00:00:00'),
                                                                                     (110, 54, 55, '2018-02-24 00:00:00'),
                                                                                     (111, 20, 56, '2018-06-05 00:00:00'),
                                                                                     (112, 55, 56, '2018-02-25 00:00:00'),
                                                                                     (113, 21, 57, '2018-06-06 00:00:00'),
                                                                                     (114, 56, 57, '2018-02-26 00:00:00'),
                                                                                     (115, 22, 58, '2018-06-07 00:00:00'),
                                                                                     (116, 57, 58, '2018-02-27 00:00:00'),
                                                                                     (117, 23, 59, '2018-06-08 00:00:00'),
                                                                                     (118, 58, 59, '2018-02-28 00:00:00'),
                                                                                     (119, 24, 60, '2018-06-09 00:00:00'),
                                                                                     (120, 59, 60, '2018-03-01 00:00:00'),
                                                                                     (121, 25, 61, '2018-06-10 00:00:00'),
                                                                                     (122, 60, 61, '2018-03-02 00:00:00'),
                                                                                     (123, 26, 62, '2018-06-11 00:00:00'),
                                                                                     (124, 61, 62, '2018-03-03 00:00:00'),
                                                                                     (125, 27, 63, '2018-06-12 00:00:00'),
                                                                                     (126, 62, 63, '2018-03-04 00:00:00'),
                                                                                     (127, 28, 64, '2018-06-13 00:00:00'),
                                                                                     (128, 63, 64, '2018-03-05 00:00:00'),
                                                                                     (129, 29, 65, '2018-06-14 00:00:00'),
                                                                                     (130, 64, 65, '2018-03-06 00:00:00'),
                                                                                     (131, 30, 66, '2018-06-15 00:00:00'),
                                                                                     (132, 65, 66, '2018-03-07 00:00:00'),
                                                                                     (133, 31, 67, '2018-06-16 00:00:00'),
                                                                                     (134, 66, 67, '2018-03-08 00:00:00'),
                                                                                     (135, 32, 68, '2018-06-17 00:00:00'),
                                                                                     (136, 67, 68, '2018-03-09 00:00:00'),
                                                                                     (137, 33, 69, '2018-06-18 00:00:00'),
                                                                                     (138, 68, 69, '2018-03-10 00:00:00'),
                                                                                     (139, 34, 70, '2018-06-19 00:00:00'),
                                                                                     (140, 69, 70, '2018-03-11 00:00:00'),
                                                                                     (141, 35, 71, '2018-06-20 00:00:00'),
                                                                                     (142, 70, 71, '2018-03-12 00:00:00'),
                                                                                     (143, 36, 72, '2018-06-21 00:00:00'),
                                                                                     (144, 71, 72, '2018-03-13 00:00:00'),
                                                                                     (145, 1, 73, '2018-06-22 00:00:00'),
                                                                                     (146, 72, 73, '2018-03-14 00:00:00'),
                                                                                     (147, 2, 74, '2018-06-23 00:00:00'),
                                                                                     (148, 73, 74, '2018-03-15 00:00:00'),
                                                                                     (149, 3, 75, '2018-06-24 00:00:00'),
                                                                                     (150, 74, 75, '2018-03-16 00:00:00'),
                                                                                     (151, 4, 76, '2018-06-25 00:00:00'),
                                                                                     (152, 75, 76, '2018-03-17 00:00:00'),
                                                                                     (153, 5, 77, '2018-06-26 00:00:00'),
                                                                                     (154, 76, 77, '2018-03-18 00:00:00'),
                                                                                     (155, 6, 78, '2018-06-27 00:00:00'),
                                                                                     (156, 77, 78, '2018-03-19 00:00:00'),
                                                                                     (157, 7, 79, '2018-06-28 00:00:00'),
                                                                                     (158, 78, 79, '2018-03-20 00:00:00'),
                                                                                     (159, 8, 80, '2018-06-29 00:00:00'),
                                                                                     (160, 79, 80, '2018-03-21 00:00:00'),
                                                                                     (161, 9, 81, '2018-06-30 00:00:00'),
                                                                                     (162, 80, 81, '2018-03-22 00:00:00'),
                                                                                     (163, 10, 82, '2018-07-01 00:00:00'),
                                                                                     (164, 81, 82, '2018-03-23 00:00:00'),
                                                                                     (165, 11, 83, '2018-07-02 00:00:00'),
                                                                                     (166, 82, 83, '2018-03-24 00:00:00'),
                                                                                     (167, 12, 84, '2018-07-03 00:00:00'),
                                                                                     (168, 83, 84, '2018-03-25 00:00:00'),
                                                                                     (169, 13, 85, '2018-07-04 00:00:00'),
                                                                                     (170, 84, 85, '2018-03-26 00:00:00'),
                                                                                     (171, 14, 86, '2018-07-05 00:00:00'),
                                                                                     (172, 85, 86, '2018-03-27 00:00:00'),
                                                                                     (173, 15, 87, '2018-07-06 00:00:00'),
                                                                                     (174, 86, 87, '2018-03-28 00:00:00'),
                                                                                     (175, 16, 88, '2018-07-07 00:00:00'),
                                                                                     (176, 87, 88, '2018-03-29 00:00:00'),
                                                                                     (177, 17, 89, '2018-07-08 00:00:00'),
                                                                                     (178, 88, 89, '2018-03-30 00:00:00'),
                                                                                     (179, 18, 90, '2018-07-09 00:00:00'),
                                                                                     (180, 89, 90, '2018-03-31 00:00:00'),
                                                                                     (181, 19, 91, '2018-07-10 00:00:00'),
                                                                                     (182, 90, 91, '2018-04-01 00:00:00'),
                                                                                     (183, 20, 92, '2018-07-11 00:00:00'),
                                                                                     (184, 91, 92, '2018-04-02 00:00:00'),
                                                                                     (185, 21, 93, '2018-07-12 00:00:00'),
                                                                                     (186, 92, 93, '2018-04-03 00:00:00'),
                                                                                     (187, 22, 94, '2018-07-13 00:00:00'),
                                                                                     (188, 93, 94, '2018-04-04 00:00:00'),
                                                                                     (189, 23, 95, '2018-07-14 00:00:00'),
                                                                                     (190, 94, 95, '2018-04-05 00:00:00'),
                                                                                     (191, 24, 96, '2018-07-15 00:00:00'),
                                                                                     (192, 95, 96, '2018-04-06 00:00:00'),
                                                                                     (193, 25, 97, '2018-07-16 00:00:00'),
                                                                                     (194, 96, 97, '2018-04-07 00:00:00'),
                                                                                     (195, 26, 98, '2018-07-17 00:00:00'),
                                                                                     (196, 97, 98, '2018-04-08 00:00:00'),
                                                                                     (197, 27, 99, '2018-07-18 00:00:00'),
                                                                                     (198, 98, 99, '2018-04-09 00:00:00'),
                                                                                     (199, 28, 100, '2018-07-19 00:00:00'),
                                                                                     (200, 99, 100, '2018-04-10 00:00:00'),
                                                                                     (201, 29, 101, '2018-07-20 00:00:00'),
                                                                                     (202, 100, 101, '2018-04-11 00:00:00'),
                                                                                     (203, 30, 102, '2018-07-21 00:00:00'),
                                                                                     (204, 101, 102, '2018-04-12 00:00:00'),
                                                                                     (205, 31, 103, '2018-07-22 00:00:00'),
                                                                                     (206, 102, 103, '2018-04-13 00:00:00'),
                                                                                     (207, 32, 104, '2018-07-23 00:00:00'),
                                                                                     (208, 103, 104, '2018-04-14 00:00:00'),
                                                                                     (209, 33, 105, '2018-07-24 00:00:00'),
                                                                                     (210, 104, 105, '2018-04-15 00:00:00'),
                                                                                     (211, 34, 106, '2018-07-25 00:00:00'),
                                                                                     (212, 105, 106, '2018-04-16 00:00:00'),
                                                                                     (213, 35, 107, '2018-07-26 00:00:00'),
                                                                                     (214, 106, 107, '2018-04-17 00:00:00'),
                                                                                     (215, 36, 108, '2018-07-27 00:00:00'),
                                                                                     (216, 107, 108, '2018-04-18 00:00:00'),
                                                                                     (217, 37, 109, '2018-07-28 00:00:00'),
                                                                                     (218, 108, 109, '2018-04-19 00:00:00'),
                                                                                     (219, 38, 110, '2018-07-29 00:00:00'),
                                                                                     (220, 109, 110, '2018-04-20 00:00:00'),
                                                                                     (221, 39, 111, '2018-07-30 00:00:00'),
                                                                                     (222, 110, 111, '2018-04-21 00:00:00'),
                                                                                     (223, 40, 112, '2018-07-31 00:00:00'),
                                                                                     (224, 111, 112, '2018-04-22 00:00:00'),
                                                                                     (225, 41, 113, '2018-08-01 00:00:00'),
                                                                                     (226, 112, 113, '2018-04-23 00:00:00'),
                                                                                     (227, 42, 114, '2018-08-02 00:00:00'),
                                                                                     (228, 113, 114, '2018-04-24 00:00:00'),
                                                                                     (229, 43, 115, '2018-08-03 00:00:00'),
                                                                                     (230, 114, 115, '2018-04-25 00:00:00'),
                                                                                     (231, 44, 116, '2018-08-04 00:00:00'),
                                                                                     (232, 115, 116, '2018-04-26 00:00:00'),
                                                                                     (233, 45, 117, '2018-08-05 00:00:00'),
                                                                                     (234, 116, 117, '2018-04-27 00:00:00'),
                                                                                     (235, 46, 118, '2018-08-06 00:00:00'),
                                                                                     (236, 117, 118, '2018-04-28 00:00:00'),
                                                                                     (237, 47, 119, '2018-08-07 00:00:00'),
                                                                                     (238, 118, 119, '2018-04-29 00:00:00'),
                                                                                     (239, 48, 120, '2018-08-08 00:00:00'),
                                                                                     (240, 119, 120, '2018-04-30 00:00:00'),
                                                                                     (241, 49, 121, '2018-08-09 00:00:00'),
                                                                                     (242, 120, 121, '2018-05-01 00:00:00'),
                                                                                     (243, 50, 122, '2018-08-10 00:00:00'),
                                                                                     (244, 121, 122, '2018-05-02 00:00:00'),
                                                                                     (245, 51, 123, '2018-08-11 00:00:00'),
                                                                                     (246, 122, 123, '2018-05-03 00:00:00'),
                                                                                     (247, 52, 124, '2018-08-12 00:00:00'),
                                                                                     (248, 123, 124, '2018-05-04 00:00:00'),
                                                                                     (249, 53, 125, '2018-08-13 00:00:00'),
                                                                                     (250, 124, 125, '2018-05-05 00:00:00'),
                                                                                     (251, 54, 126, '2018-08-14 00:00:00'),
                                                                                     (252, 125, 126, '2018-05-06 00:00:00'),
                                                                                     (253, 55, 127, '2018-08-15 00:00:00'),
                                                                                     (254, 126, 127, '2018-05-07 00:00:00'),
                                                                                     (255, 56, 128, '2018-08-16 00:00:00'),
                                                                                     (256, 127, 128, '2018-05-08 00:00:00'),
                                                                                     (257, 57, 129, '2018-08-17 00:00:00'),
                                                                                     (258, 128, 129, '2018-05-09 00:00:00'),
                                                                                     (259, 58, 130, '2018-08-18 00:00:00'),
                                                                                     (260, 129, 130, '2018-05-10 00:00:00'),
                                                                                     (261, 59, 131, '2018-08-19 00:00:00'),
                                                                                     (262, 130, 131, '2018-05-11 00:00:00'),
                                                                                     (263, 60, 132, '2018-08-20 00:00:00'),
                                                                                     (264, 131, 132, '2018-05-12 00:00:00'),
                                                                                     (265, 61, 133, '2018-08-21 00:00:00'),
                                                                                     (266, 132, 133, '2018-05-13 00:00:00'),
                                                                                     (267, 62, 134, '2018-08-22 00:00:00'),
                                                                                     (268, 133, 134, '2018-05-14 00:00:00'),
                                                                                     (269, 63, 135, '2018-08-23 00:00:00'),
                                                                                     (270, 134, 135, '2018-05-15 00:00:00'),
                                                                                     (271, 64, 136, '2018-08-24 00:00:00'),
                                                                                     (272, 135, 136, '2018-05-16 00:00:00'),
                                                                                     (273, 65, 137, '2018-08-25 00:00:00'),
                                                                                     (274, 136, 137, '2018-05-17 00:00:00'),
                                                                                     (275, 66, 138, '2018-08-26 00:00:00'),
                                                                                     (276, 137, 138, '2018-05-18 00:00:00'),
                                                                                     (277, 67, 139, '2018-08-27 00:00:00'),
                                                                                     (278, 138, 139, '2018-05-19 00:00:00'),
                                                                                     (279, 68, 140, '2018-08-28 00:00:00'),
                                                                                     (280, 139, 140, '2018-05-20 00:00:00'),
                                                                                     (281, 69, 141, '2018-08-29 00:00:00'),
                                                                                     (282, 140, 141, '2018-05-21 00:00:00'),
                                                                                     (283, 70, 142, '2018-08-30 00:00:00'),
                                                                                     (284, 141, 142, '2018-05-22 00:00:00'),
                                                                                     (285, 71, 143, '2018-08-31 00:00:00'),
                                                                                     (286, 142, 143, '2018-05-23 00:00:00'),
                                                                                     (287, 72, 144, '2018-09-01 00:00:00'),
                                                                                     (288, 143, 144, '2018-05-24 00:00:00'),
                                                                                     (289, 73, 145, '2018-09-02 00:00:00'),
                                                                                     (290, 144, 145, '2018-05-25 00:00:00'),
                                                                                     (291, 74, 146, '2018-09-03 00:00:00'),
                                                                                     (292, 145, 146, '2018-05-26 00:00:00'),
                                                                                     (293, 75, 147, '2018-09-04 00:00:00'),
                                                                                     (294, 146, 147, '2018-05-27 00:00:00'),
                                                                                     (295, 76, 148, '2018-09-05 00:00:00'),
                                                                                     (296, 147, 148, '2018-05-28 00:00:00'),
                                                                                     (297, 77, 149, '2018-09-06 00:00:00'),
                                                                                     (298, 148, 149, '2018-05-29 00:00:00'),
                                                                                     (299, 78, 150, '2018-09-07 00:00:00'),
                                                                                     (300, 149, 150, '2018-05-30 00:00:00'),
                                                                                     (301, 79, 151, '2018-09-08 00:00:00'),
                                                                                     (302, 150, 151, '2018-05-31 00:00:00'),
                                                                                     (303, 80, 152, '2018-09-09 00:00:00'),
                                                                                     (304, 151, 152, '2018-06-01 00:00:00'),
                                                                                     (305, 81, 153, '2018-09-10 00:00:00'),
                                                                                     (306, 152, 153, '2018-06-02 00:00:00'),
                                                                                     (307, 82, 154, '2018-09-11 00:00:00'),
                                                                                     (308, 153, 154, '2018-06-03 00:00:00'),
                                                                                     (309, 83, 155, '2018-09-12 00:00:00'),
                                                                                     (310, 154, 155, '2018-06-04 00:00:00'),
                                                                                     (311, 84, 156, '2018-09-13 00:00:00'),
                                                                                     (312, 155, 156, '2018-06-05 00:00:00'),
                                                                                     (313, 85, 157, '2018-09-14 00:00:00'),
                                                                                     (314, 156, 157, '2018-06-06 00:00:00'),
                                                                                     (315, 86, 158, '2018-09-15 00:00:00'),
                                                                                     (316, 157, 158, '2018-06-07 00:00:00'),
                                                                                     (317, 87, 159, '2018-09-16 00:00:00'),
                                                                                     (318, 158, 159, '2018-06-08 00:00:00'),
                                                                                     (319, 88, 160, '2018-09-17 00:00:00'),
                                                                                     (320, 159, 160, '2018-06-09 00:00:00'),
                                                                                     (321, 89, 161, '2018-09-18 00:00:00'),
                                                                                     (322, 160, 161, '2018-06-10 00:00:00'),
                                                                                     (323, 90, 162, '2018-09-19 00:00:00'),
                                                                                     (324, 161, 162, '2018-06-11 00:00:00'),
                                                                                     (325, 91, 163, '2018-09-20 00:00:00'),
                                                                                     (326, 162, 163, '2018-06-12 00:00:00'),
                                                                                     (327, 92, 164, '2018-09-21 00:00:00'),
                                                                                     (328, 163, 164, '2018-06-13 00:00:00'),
                                                                                     (329, 93, 165, '2018-09-22 00:00:00'),
                                                                                     (330, 164, 165, '2018-06-14 00:00:00'),
                                                                                     (331, 94, 166, '2018-09-23 00:00:00'),
                                                                                     (332, 165, 166, '2018-06-15 00:00:00'),
                                                                                     (333, 95, 167, '2018-09-24 00:00:00'),
                                                                                     (334, 166, 167, '2018-06-16 00:00:00'),
                                                                                     (335, 96, 168, '2018-09-25 00:00:00'),
                                                                                     (336, 167, 168, '2018-06-17 00:00:00'),
                                                                                     (337, 97, 169, '2018-09-26 00:00:00'),
                                                                                     (338, 168, 169, '2018-06-18 00:00:00'),
                                                                                     (339, 98, 170, '2018-09-27 00:00:00'),
                                                                                     (340, 169, 170, '2018-06-19 00:00:00'),
                                                                                     (341, 99, 171, '2018-09-28 00:00:00'),
                                                                                     (342, 170, 171, '2018-06-20 00:00:00'),
                                                                                     (343, 100, 172, '2018-09-29 00:00:00'),
                                                                                     (344, 171, 172, '2018-06-21 00:00:00'),
                                                                                     (345, 101, 173, '2018-09-30 00:00:00'),
                                                                                     (346, 172, 173, '2018-06-22 00:00:00'),
                                                                                     (347, 102, 174, '2018-10-01 00:00:00'),
                                                                                     (348, 173, 174, '2018-06-23 00:00:00'),
                                                                                     (349, 103, 175, '2018-10-02 00:00:00'),
                                                                                     (350, 174, 175, '2018-06-24 00:00:00'),
                                                                                     (351, 104, 176, '2018-10-03 00:00:00'),
                                                                                     (352, 175, 176, '2018-06-25 00:00:00'),
                                                                                     (353, 105, 177, '2018-10-04 00:00:00'),
                                                                                     (354, 176, 177, '2018-06-26 00:00:00'),
                                                                                     (355, 106, 178, '2018-10-05 00:00:00'),
                                                                                     (356, 177, 178, '2018-06-27 00:00:00'),
                                                                                     (357, 107, 179, '2018-10-06 00:00:00'),
                                                                                     (358, 178, 179, '2018-06-28 00:00:00'),
                                                                                     (359, 108, 180, '2018-10-07 00:00:00'),
                                                                                     (360, 179, 180, '2018-06-29 00:00:00'),
                                                                                     (361, 109, 181, '2018-10-08 00:00:00'),
                                                                                     (362, 180, 181, '2018-06-30 00:00:00'),
                                                                                     (363, 110, 182, '2018-10-09 00:00:00'),
                                                                                     (364, 181, 182, '2018-07-01 00:00:00'),
                                                                                     (365, 111, 183, '2018-10-10 00:00:00'),
                                                                                     (366, 182, 183, '2018-07-02 00:00:00'),
                                                                                     (367, 112, 184, '2018-10-11 00:00:00'),
                                                                                     (368, 183, 184, '2018-07-03 00:00:00'),
                                                                                     (369, 113, 185, '2018-10-12 00:00:00'),
                                                                                     (370, 184, 185, '2018-07-04 00:00:00'),
                                                                                     (371, 114, 186, '2018-10-13 00:00:00'),
                                                                                     (372, 185, 186, '2018-07-05 00:00:00'),
                                                                                     (373, 115, 187, '2018-10-14 00:00:00'),
                                                                                     (374, 186, 187, '2018-07-06 00:00:00'),
                                                                                     (375, 116, 188, '2018-10-15 00:00:00'),
                                                                                     (376, 187, 188, '2018-07-07 00:00:00'),
                                                                                     (377, 117, 189, '2018-10-16 00:00:00'),
                                                                                     (378, 188, 189, '2018-07-08 00:00:00'),
                                                                                     (379, 118, 190, '2018-10-17 00:00:00'),
                                                                                     (380, 189, 190, '2018-07-09 00:00:00'),
                                                                                     (381, 119, 191, '2018-10-18 00:00:00'),
                                                                                     (382, 190, 191, '2018-07-10 00:00:00'),
                                                                                     (383, 120, 192, '2018-10-19 00:00:00'),
                                                                                     (384, 191, 192, '2018-07-11 00:00:00'),
                                                                                     (385, 121, 193, '2018-10-20 00:00:00'),
                                                                                     (386, 192, 193, '2018-07-12 00:00:00'),
                                                                                     (387, 122, 194, '2018-10-21 00:00:00'),
                                                                                     (388, 193, 194, '2018-07-13 00:00:00'),
                                                                                     (389, 123, 195, '2018-10-22 00:00:00'),
                                                                                     (390, 194, 195, '2018-07-14 00:00:00'),
                                                                                     (391, 124, 196, '2018-10-23 00:00:00'),
                                                                                     (392, 195, 196, '2018-07-15 00:00:00'),
                                                                                     (393, 125, 197, '2018-10-24 00:00:00'),
                                                                                     (394, 196, 197, '2018-07-16 00:00:00'),
                                                                                     (395, 126, 198, '2018-10-25 00:00:00'),
                                                                                     (396, 197, 198, '2018-07-17 00:00:00'),
                                                                                     (397, 127, 199, '2018-10-26 00:00:00'),
                                                                                     (398, 198, 199, '2018-07-18 00:00:00'),
                                                                                     (399, 128, 200, '2018-10-27 00:00:00'),
                                                                                     (400, 199, 200, '2018-07-19 00:00:00'),
                                                                                     (401, 129, 201, '2018-10-28 00:00:00'),
                                                                                     (402, 200, 201, '2018-07-20 00:00:00'),
                                                                                     (403, 130, 202, '2018-10-29 00:00:00'),
                                                                                     (404, 201, 202, '2018-07-21 00:00:00'),
                                                                                     (405, 131, 203, '2018-10-30 00:00:00'),
                                                                                     (406, 202, 203, '2018-07-22 00:00:00'),
                                                                                     (407, 132, 204, '2018-10-31 00:00:00'),
                                                                                     (408, 203, 204, '2018-07-23 00:00:00'),
                                                                                     (409, 133, 205, '2018-11-01 00:00:00'),
                                                                                     (410, 204, 205, '2018-07-24 00:00:00'),
                                                                                     (411, 134, 206, '2018-11-02 00:00:00'),
                                                                                     (412, 205, 206, '2018-07-25 00:00:00'),
                                                                                     (413, 135, 207, '2018-11-03 00:00:00'),
                                                                                     (414, 206, 207, '2018-07-26 00:00:00'),
                                                                                     (415, 136, 208, '2018-11-04 00:00:00'),
                                                                                     (416, 207, 208, '2018-07-27 00:00:00'),
                                                                                     (417, 137, 209, '2018-11-05 00:00:00'),
                                                                                     (418, 208, 209, '2018-07-28 00:00:00'),
                                                                                     (419, 138, 210, '2018-11-06 00:00:00'),
                                                                                     (420, 209, 210, '2018-07-29 00:00:00'),
                                                                                     (421, 139, 211, '2018-11-07 00:00:00'),
                                                                                     (422, 210, 211, '2018-07-30 00:00:00'),
                                                                                     (423, 140, 212, '2018-11-08 00:00:00'),
                                                                                     (424, 211, 212, '2018-07-31 00:00:00'),
                                                                                     (425, 141, 213, '2018-11-09 00:00:00'),
                                                                                     (426, 212, 213, '2018-08-01 00:00:00'),
                                                                                     (427, 142, 214, '2018-11-10 00:00:00'),
                                                                                     (428, 213, 214, '2018-08-02 00:00:00'),
                                                                                     (429, 143, 215, '2018-11-11 00:00:00'),
                                                                                     (430, 214, 215, '2018-08-03 00:00:00'),
                                                                                     (431, 144, 216, '2018-11-12 00:00:00'),
                                                                                     (432, 215, 216, '2018-08-04 00:00:00'),
                                                                                     (433, 145, 217, '2018-11-13 00:00:00'),
                                                                                     (434, 216, 217, '2018-08-05 00:00:00'),
                                                                                     (435, 146, 218, '2018-11-14 00:00:00'),
                                                                                     (436, 217, 218, '2018-08-06 00:00:00'),
                                                                                     (437, 147, 219, '2018-11-15 00:00:00'),
                                                                                     (438, 218, 219, '2018-08-07 00:00:00'),
                                                                                     (439, 148, 220, '2018-11-16 00:00:00'),
                                                                                     (440, 219, 220, '2018-08-08 00:00:00'),
                                                                                     (441, 149, 221, '2018-11-17 00:00:00'),
                                                                                     (442, 220, 221, '2018-08-09 00:00:00'),
                                                                                     (443, 150, 222, '2018-11-18 00:00:00'),
                                                                                     (444, 221, 222, '2018-08-10 00:00:00'),
                                                                                     (445, 151, 223, '2018-11-19 00:00:00');
/*!40000 ALTER TABLE subscriptions ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Teachers`
--

DROP TABLE IF EXISTS teachers;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE teachers (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '  \n',
  `salary` int(10) unsigned DEFAULT NULL COMMENT '  ',
  `age` int(10) unsigned DEFAULT NULL COMMENT ' ',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Teachers`
--

# LOCK TABLES teachers WRITE;
/*!40000 ALTER TABLE teachers DISABLE KEYS */;
INSERT INTO teachers VALUES (1,'Ягешев Сидор',10000,18),(2,'Яглинцев Владислав',20000,19),(3,'Апалков Ростислав',30000,20),(4,'Колиух Вацлав',5000,21),(5,'Ядренкин Елисей',2000,22),(6,'Шерков Артемий',3000,23),(7,'Хованский Платон',4000,24),(8,'Неелов Федор',6000,25),(9,'Калугер Вениамин',7500,26),(10,'Лобан Эммануил',8500,27),(11,'Яньков Эрнест',10000,28),(12,'Александрович Викентий',20000,29),(13,'Карявин Ерофей',30000,30),(14,'Корявин Илья',5000,31),(15,'Ямщиков Леонид',2000,32),(16,'Баскаков Егор',3000,33),(17,'Рождественский Ян',4000,34),(18,'Булдаков Евсей',6000,35),(19,'Седегов Варфоломей',7500,36),(20,'Пугачёв Лукьян',8500,37),(21,'Кубышкин Трофим',10000,38),(22,'Гавшин Онисим',20000,39),(23,'Яржемковский Дмитрий',30000,40),(24,'Янко Петр',5000,41),(25,'Сияница Олег',2000,42),(26,'Борисюк Саввелий',3000,43),(27,'Травников Ипатий',4000,18),(28,'Ерохин Павел',6000,19),(29,'Раскатов Вадим',7500,20),(30,'Разумов Феофан',8500,21),(31,'Лужков Назар',10000,22),(32,'Вельдин Вячеслав',20000,23),(33,'Яснов Онуфрий',30000,24),(34,'Касимов Прокофий',5000,25),(35,'Ажищенков Фома',2000,26),(36,'Столяров Авдей',3000,27),(37,'Федченков Константин',4000,28),(38,'Шамило Лаврентий',6000,29),(39,'Геремеш Георгий',7500,30),(40,'Кизюрин Евграф',8500,31),(41,'Чубаров Еремей',10000,32),(42,'Яблоновский Юлий',20000,33),(43,'Серов Яков',30000,34),(44,'Дьячков Мирон',5000,35),(45,'Матеров Данил',2000,36),(46,'Гурин Фока',3000,37),(47,'Панькив Поликарп',4000,38),(48,'Киселев Александр',6000,39),(49,'Махов Валентин',7500,40),(50,'Чечуров Радион',8500,41);
/*!40000 ALTER TABLE teachers ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-04-22 16:54:13
